Revit 2027 API
Element.IsMonitoringLinkElement Method
 Indicate whether an element is monitoring any elements in any linked models.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMonitoringLinkElement()
Public Function IsMonitoringLinkElement As Boolean
public:
bool IsMonitoringLinkElement()
member IsMonitoringLinkElement : unit -> bool
Return Value
Boolean
 True if this element is monitoring elements in a linked models. Otherwise, false will be returned.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace